app/views/estatesales/show.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."estatesale_id" = $1  [["estatesale_id", 2]]
---
        <% if logged_in? %>
          <%- unless current_user.favorite_sales.exists?(id: @sale.id) -%>