app/controllers/estatesales_controller.rb

  def index
    @sales = Estatesale.all
---
SELECT "estatesales".* FROM "estatesales"

  def show
    @sale = Estatesale.find(params[:id])
---
SELECT  "estatesales".* FROM "estatesales" WHERE "estatesales"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @sale = Estatesale.find(params[:id])
---
SELECT  "estatesales".* FROM "estatesales" WHERE "estatesales"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @sale = Estatesale.new(estatesale_params)

    if @sale.save
---
INSERT INTO "estatesales" ("title", "address", "city", "state", "zip_code", "start_date", "end_date", "times", "description", "forms_of_payment", "special_inst", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def update
    @sale = Estatesale.find(params[:id])

    if @sale.update(estatesale_params)
---
SELECT  "estatesales".* FROM "estatesales" WHERE "estatesales"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "estatesales" SET "start_date" = $1, "end_date" = $2, "forms_of_payment" = $3, "updated_at" = $4 WHERE "estatesales"."id" = $5  [["start_date", ""], ["end_date", ""], ["forms_of_payment", "CC, checks, cash"], ["updated_at", "2015-12-13 20:46:59.336237"], ["id", 6]]

  def destroy
    @sale = Estatesale.find(params[:id])
    @sale.destroy
---
SELECT  "estatesales".* FROM "estatesales" WHERE "estatesales"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "estatesales" WHERE "estatesales"."id" = $1  [["id", 6]]