app/controllers/favorite_sales_controller.rb

  def index
    @favorites = current_user.favorite_sales
    # @fav = Favorite.where(favorited_id: @sale.id, user_id: current_user.id)
    @sale = Estatesale.find(params[:sale_id] || params[:id])
---
SELECT  "estatesales".* FROM "estatesales" WHERE "estatesales"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    if Favorite.create(favorited: @sale, user: current_user)
---
INSERT INTO "favorites" ("favorited_id", "favorited_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["favorited_id", 2], ["favorited_type", "Estatesale"], ["user_id", 11], ["created_at", "2015-12-14 01:32:45.993841"], ["updated_at", "2015-12-14 01:32:45.993841"]]

  def set_sale
    @sale = Estatesale.find(params[:sale_id] || params[:id])
---
SELECT  "estatesales".* FROM "estatesales" WHERE "estatesales"."id" = $1 LIMIT 1  [["id", 5]]